info_lek = [
    (1, "нурофен", "при головной боли и жаре", "США", 5000),
    (2, "ношпа","при болях в животе","США", 400),
    (3, "дротоверин","при спазмах","Россия", 200 ),
    (4, "ибуклин","при жаре и боли","Индия",499),
    (5, "аспирин","для кровообращения","Россия",800),
    (6, "амбробене","при кашле","Германия",0),
    (7, "корень солодки","при кашле","Россия",50),
    (8, "метформин","при проблемах с печенью","Германия",9000),
    (9, "азитромецин","при бактериальных инфекциях","Россия", 899 ),
    (10, "магний В6","при недостатке магния","Россия",500)
]

info_nal = [
    (1,1000,'2020-05-05'),
    (2,0,'2020-12-05'),
    (3,102,'2020-06-03'),
    (4,678,'2020-09-27'),
    (5,0,'2020-10-25'),
    (6,987,'2021-10-30'),
    (7,9,'2020-05-06'),
    (8,909,'2020-09-10'),
    (9,8,'2021-11-01'),
    (10,876,'2020-09-10')
]

info_punkt = [
    (1,"ул. Стрелковая","нурофен",500,'2023-03-05',5000),
    (2,"ул. Пожарного","ношпа",600,'2023-10-20',56000),
    (3,"ул. Пушкина","дротоверин",55,'2023-09-30',2859),
    (4,"ул. Весницкая","ибуклин",600,'2023-06-29',87000),
    (5,"ул. Бабушкина","аспирин",789,'2023-02-08',9000),
    (6,"ул. Воскресная","амбробене",865,'2023-03-05',1500),
    (7,"ул. Минина","корень солодки",300,'2023-09-20',8000),
    (8,"ул. Маленькая","метформин",200,'2023-03-05',2000),
    (9,"ул. Римская","азитромецин",100,'2023-09-20',90000),
    (10,"ул. Солнечная","магний В6",80,'2023-03-19',45000)
]